app/views/rooms/index.html.erb

    <td><%= best_in_place room, :parity, type: :select, :collection => Room::parities, :nil => "-----" %></td>
    <td><%= best_in_place room, :group_b_strep, type: :select, :collection => Room::group_b_streps,:nil => "-----" %></td>
---
SELECT "rooms".* FROM "rooms"