app/controllers/patients_controller.rb

  def new
    @patient = Patient.new
		@room_index = params[:param1]
    @room = Room.where(["index_number = ?", @room_index])
---
SELECT "rooms".* FROM "rooms" WHERE (index_number = '2') LIMIT 1